OdGUID.setGUIDdata(System.UInt32!System.Runtime.CompilerServices.IsLong!System.Runtime.CompilerServices.IsConst,System.UInt16!System.Runtime.CompilerServices.IsConst,System.UInt16!System.Runtime.CompilerServices.IsConst,System.Byte!System.Runtime.CompilerServices.IsConst(*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)[N8])
\details
Sets the GUID data.

OdGUID.toString(OdGUID.StringFormat.Enum!System.Runtime.CompilerServices.IsConst)
\details
Returns string representation for this OdGUID.
\param format [in]  A single format specifier that indicates how to format the value of this OdGUID.
Default value is OdGUID::StringFormat::Hyphenses.
\remarks
The following table shows the accepted format specifiers for the format parameter.
"0" represents a digit; hyphens ("-"), braces ("{", "}"), and parentheses ("(", ")") appear as shown.
OdGUID::StringFormat::Digits:      00000000000000000000000000000000
OdGUID::StringFormat::Hyphenses:   00000000-0000-0000-0000-000000000000
OdGUID::StringFormat::Braces:      {00000000-0000-0000-0000-000000000000}
OdGUID::StringFormat::Parentheses: (00000000-0000-0000-0000-000000000000)
OdGUID::StringFormat::Extended:    {0x00000000,0x0000,0x0000,{0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00}}
OdGUID::StringFormat::Base64String: Encoded of the base 64 characters compressed string.
Contains 22 characters + 1 for the terminating 0

OdGUID.op_Assign(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Assignment operator.
\param other [in] String representation of the GUID to be assigned.

OdGUID.op_Assign(OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Assignment operator.
\param other [in] String representation of the GUID to be assigned.

OdGUID.op_Assign(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Assignment operator.
\param other [in] Other GUID object to be assigned.
\details
Assignment operator.
\param other [in] String representation of the GUID to be assigned.

OdGUID.#ctor(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Creates a new instance of an OdGUID object with the copied data from the string representation of GUID.
\param value [in] GUID string to copy from.

OdGUID.#ctor(OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Creates a new instance of an OdGUID object with the copied data from the string representation of GUID.
\param value [in] GUID string to copy from.

OdGUID.#ctor(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Creates a new instance of an OdGUID object with the copied data from the string representation of GUID.
\param value [in] GUID string to copy from.

OdGUID.#ctor(System.Byte!System.Runtime.CompilerServices.IsConst(*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)[N16])
\details
Creates a new instance of an OdGUID object with the copied data from the other data.
\param data [in] GUID data to copy from.

OdGUID.#ctor(System.UInt32!System.Runtime.CompilerServices.IsLong!System.Runtime.CompilerServices.IsConst,System.UInt16!System.Runtime.CompilerServices.IsConst,System.UInt16!System.Runtime.CompilerServices.IsConst,System.Byte!System.Runtime.CompilerServices.IsConst,System.Byte!System.Runtime.CompilerServices.IsConst,System.Byte!System.Runtime.CompilerServices.IsConst,System.Byte!System.Runtime.CompilerServices.IsConst,System.Byte!System.Runtime.CompilerServices.IsConst,System.Byte!System.Runtime.CompilerServices.IsConst,System.Byte!System.Runtime.CompilerServices.IsConst,System.Byte!System.Runtime.CompilerServices.IsConst)
\details
Creates a new instance of a OdGUID object with copied data from other object.
\param other [in] Object to copy from.